<a href="https://colab.research.google.com/github/vikasmastud7/machinelearning/blob/master/pandas_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [0]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                                  '12. Air France', '"Swiss Air"']})

Q1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [3]:
non_empty = None
for i, val in enumerate(df.FlightNumber.fillna(0)):
  if val != 0.0:
    non_empty = (i,val)
    break
if non_empty != None:
  zero_index = non_empty[1] - (non_empty[0] * 10)
  for i in range(len(df.FlightNumber)):
    df.FlightNumber[i] = zero_index 
    zero_index += 10

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':

In [4]:
df.head()

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

Q2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [0]:
df2 = df.From_To.str.split("_",n = 1, expand = True)

In [0]:
df2.columns = ["From","To"]

In [7]:
df2.head()

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

Q3 Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [8]:
df2.From = df2.From.str.title()
df2.head()

       From         To
0    London      paris
1    Madrid      miLAN
2    London  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

Q4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [9]:
df.drop("From_To",inplace=True,axis = 1)
df = pd.concat([df2,df],axis=1)
df.head()

       From         To  FlightNumber  RecentDelays              Airline
0    London      paris       10045.0      [23, 47]               KLM(!)
1    Madrid      miLAN       10055.0            []    <Air France> (12)
2    London  StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3  Budapest      PaRis       10075.0          [13]       12. Air France
4  Brussels     londOn       10085.0      [67, 32]          "Swiss Air"

Q5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [0]:
recentdays = df.RecentDelays.values.tolist()

In [0]:
m = float("-inf")
for i in recentdays:
  m = max(m , len(i))

In [0]:
newdf = pd.DataFrame(recentdays, columns=["delays_"+str(i) for i in range(1,m+1)])

In [13]:
newdf.head()

   delays_1  delays_2  delays_3
0      23.0      47.0       NaN
1       NaN       NaN       NaN
2      24.0      43.0      87.0
3      13.0       NaN       NaN
4      67.0      32.0       NaN

In [0]:
df.drop("RecentDelays",inplace=True, axis=1)

In [15]:
df = pd.concat([df,newdf],axis=1)
df.head()

       From         To  FlightNumber  ... delays_1  delays_2  delays_3
0    London      paris       10045.0  ...     23.0      47.0       NaN
1    Madrid      miLAN       10055.0  ...      NaN       NaN       NaN
2    London  StockhOlm       10065.0  ...     24.0      43.0      87.0
3  Budapest      PaRis       10075.0  ...     13.0       NaN       NaN
4  Brussels     londOn       10085.0  ...     67.0      32.0       NaN

[5 rows x 7 columns]